[
    {
        "date": "1965-1967",
        "title": "ACM@UCI is Founded",
        "desc": "Decades before companies like Amazon or Google are founded, years before the first ICPC, and even a year before ICS becomes a department at UCI, ACM@UCI is started as a local chapter of the Association for Computing Machinery (ACM)."
    },
    {
        "date": "1990-1991",

        "title": "ACM@UCI Competes in World Finals for the First Time",
        "desc": "After placing 2nd at the 1990 ICPC Southern California Regional (being beat only by a team from New Zealand), ACM@UCI advances to the ICPC World Finals, then known as the ACM Scholastic Computing Contest, held in San Antonio, Texas. The team of four ultimately places 14th."
    },
    {
        "date": "2013-2014",

        "title": "ACM@UCI Competes in World Finals",
        "desc": "After placing 2nd at the 2013 ICPC Southern California Regional, ACM@UCI advances to the 2014 ICPC World Finals."
    },
    {
        "date": "October 2016",

        "title": "UCI 76ers Rank 1st Nationally at IEEExtreme 10.0",
        "desc": "ACM@UCI's team UCI 76ers places 1st in the US at IEEExtreme 10.0.",
        "img": "ieeextreme_10_76ers.jpg",
        "caption": "UCI 76ers shortly after IEEExtreme 10.0"
    },
    {
        "date": "2016-2017",

        "title": "filter Competes in World Finals",
        "desc": "After finishing 1st at the 2016 ICPC Southern California Regional (including solving a problem in the last 24 seconds of the competition), ACM@UCI's team filter advances to the 2017 ICPC World Finals.",
        "img": "icpc_socal_2016_filter.jpg",
        "caption": "Team filter after winning the 2016 SoCal Regional"
    },
    {
        "date": "October 2017",
        "title": "UCI 76ers Rank 2nd Nationally at IEEExtreme 11.0",
        "desc": "ACM@UCI's team UCI 76ers places 2nd in the US at IEEExtreme 11.0.",
        "img": "ieeextreme_11.jpg",
        "caption": "Students competing at IEEExtreme 11.0"
    },
    {
        "date": "November 2017",

        "title": "filter Places 3rd in SoCal",
        "desc": "At the 2017 ICPC Southern California Regional, ACM@UCI's team filter pulls off another successful finish at 3rd place. Overall, ACM@UCI does extremely well, getting all 5 of its teams into the top 25.",
        "img": "icpc_socal_2017.jpg",
        "caption": "ACM@UCI members at the 2017 ICPC SoCal Regional"
    },
    {
        "date": "Spring 2018",

        "title": "First Seminar Series",
        "desc": "ACM@UCI hosts its first seminar series, with students giving talks on computer science topics as diverse as gambling, medical imaging, and functional programming."
    },
    {
        "date": "October 2018",

        "title": "IEEExtreme 12.0",
        "desc": "At IEEExtreme 12.0, two teams from ACM@UCI, sheep and sleep24hrs, place in the top 100 in the world. The two teams also rank 6th and 7th in the US, respectively.",
        "img": "ieeextreme_12_sleep24hrs.jpg",
        "caption": "sleep24hrs shortly after IEEExtreme 12.0"
    },
    {
        "date": "November 2018",

        "title": "2018 SoCal Regional",
        "desc": "Despite losing most of its senior members, ACM@UCI teams pull off successful finishes at the 2018 SoCal Regional, with two teams, filter and iterator, ranking 7th and 9th, and all 5 teams ranking in the top 25 yet again.",
        "img": "icpc_socal_2018.jpg",
        "caption": "ACM@UCI members at the 2018 ICPC SoCal Regional"
    },
    {
        "date": "Winter 2019",

        "title": "Seminar Series v2",
        "desc": "ACM@UCI hosts another seminar series, once again with diverse talks.",
        "img": "seminar_winter_2019.jpg",
        "caption": "Karthik Gajulapalli presenting for the ACM Seminar Series, Winter 2019"
    },
    {
        "date": "October 2019",
        "title": "IEEExtreme 13.0",
        "desc": "At IEEExtreme 13.0, a 24-hour worldwide programming contest, ACM@UCI gets three teams, OutOfPractice, Pan, and zotReduce, into the top 100 in the world. The three teams also rank 4th, 6th, and 7th in the US.",
        "img": "ieeextreme_13.jpg",
        "caption": "UCI students after IEEExtreme 13"
    },
    {
        "date": "November 2019",
        "title": "2019 SoCal Regional",
        "desc": "ACM@UCI sends five teams to the 2019 SoCal Regional. At the end of the contest, team filter ranks highest, at 7th place",
        "img": "icpc_socal_2019.jpg",
        "caption": "ACM@UCI members at the 2019 ICPC SoCal Regional"
    },
    {
        "date": "April 2020",
        "title": "ACM 2020 Outstanding Website",
        "desc": "Just over two years after its inception, the ACM@UCI website was recognized with the ACM 2020 Outstanding Website award as part of the ACM Excellence Awards.",
        "img": "Website_2020.jpg",
        "caption": "ACM@UCI receives Outstanding Website 2020 award"
    },
    {
        "date": "February 2021",
        "title": "2020-21 SoCal Regional",
        "desc": "In an usual year, COVID-19 forces ICPC Socal Regionals to host its first ever online competition. ACM@UCI sends 11 teams, of which team Map ranks highest at 9th place. UCI advances two teams to the first ever ICPC North American Division Championships.",
        "img": "icpc_socal_2020.jpg",
        "caption": "The final scoreboard at 2020 ICPC SoCal Regional"
    },
    {
        "date": "April 2021",
        "title": "2021 ICPC North American Division Championship",
        "desc": "In the first year ICPC held NADC, ACM@UCI sends two teams - Comprehension and Map. In the challenging field, team Comprehension and team Map place 22nd and 25th respectively in the west division.",
        "img": "2021_icpc_nadc.webp",
        "caption": "ICPC NADC"
    }
]
